LinChuHong/L_2026_Stm32H723ZGT6_Cmake/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */
#ifdef SDMMC_INIT_CLK_DIV
#undef SDMMC_INIT_CLK_DIV
#define SDMMC_INIT_CLK_DIV ((uint16_t)270)
#endif


/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KEY0_Pin GPIO_PIN_1
#define KEY0_GPIO_Port GPIOC
#define RTP_MISO_Pin GPIO_PIN_4
#define RTP_MISO_GPIO_Port GPIOC
#define LED0_Pin GPIO_PIN_0
#define LED0_GPIO_Port GPIOB
#define LED1_Pin GPIO_PIN_1
#define LED1_GPIO_Port GPIOB
#define LCD_RST_Pin GPIO_PIN_2
#define LCD_RST_GPIO_Port GPIOB
#define CTP_SDA_RTP_MOSI_Pin GPIO_PIN_11
#define CTP_SDA_RTP_MOSI_GPIO_Port GPIOD
#define CTP_SCL_TRO_SCK_Pin GPIO_PIN_12
#define CTP_SCL_TRO_SCK_GPIO_Port GPIOD
#define CTP_INT_RTP_SCK_Pin GPIO_PIN_13
#define CTP_INT_RTP_SCK_GPIO_Port GPIOD
#define CTP_RSR_RTP_CS_Pin GPIO_PIN_3
#define CTP_RSR_RTP_CS_GPIO_Port GPIOG
#define LCD_BL_Pin GPIO_PIN_14
#define LCD_BL_GPIO_Port GPIOG

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
